[
  {
    "footnotes": [],
    "number": 1,
    "hadith_title": {
      "ms": "Kepentingan Niat dalam Amalan",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه إماما المحدثين: أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بردزبة البخاري وأبو الحسين مسلم بن الحجاج بن مسلم القشيري النيسابوري في صحيحيهما اللذين هما أصح الكتب المصنفة.)",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim dalam Sahih al-Bukhari dan Sahih Muslim yang merupakan kitab yang paling sahih.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Setiap amalan bergantung pada niat. Setiap orang hanya memperoleh sesuatu yang diniatkannya. Sesiapa yang berhijrah kerana Allah SWT dan rasul-Nya, maka hijrahnya itu kerana Allah SWT dan rasul-Nya (diterima dan diberi ganjaran), manakala sesiapa yang berhijrah kerana tujuan keduniaan yang ingin diperolehnya atau kerana wanita yang ingin dinikahinya, maka hijrahnya akan mendapat sesuatu yang diniatkannya. ",
        "ar": "إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ وَإِنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللهِ وَرَسُولِهِ، فَهِجْرَتُهُ إِلَى اللهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا یُصِيبُهَا أَوِ امْرَأَةٍ یَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Setiap amalan bergantung pada niat. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Sesiapa yang melakukan amalan kerana perintah Allah SWT dan tuntutan rasul-Nya, dia akan mendapat ganjaran pahala.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Amalan yang baik tetapi tidak diniatkan kerana Allah SWT adalah sia-sia. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Amirulmukminin Abu Hafs Umar bin al-Khattab r.a.: Aku mendengar Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 2,
    "hadith_title": {
      "ms": "Islam, Iman dan Ihsan",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Wahai, Muhammad! Terangkan aku tentang Islam. Lalu Rasulullah SAW bersabda: lslam itu ialah kamu bersaksi tiada Tuhan melainkan Allah dan Muhammad itu utusan Allah, mendirikan solat, mengeluarkan zakat, berpuasa pada bulan Ramadan, menunaikan haji di Baitullah (Makkah) sekiranya berkemampuan. Lelaki tersebut berkata: Kamu benar. Maka kami pun berasa hairan kepadanya, dia yang bertanya, dia pula yang membenarkannya. Dia bertanya: Terangkan aku tentang iman. Baginda bersabda: Iman itu ialah kamu percaya kepada Allah SWT, para malaikat-Nya, kitab-kitab-Nya, para rasul-Nya, hari kiamat dan qadar baik dan buruk. Lelaki itu berkata: Kamu benar. Dia berkata lagi: Terangkanlah aku tentang ihsan. Baginda bersabda: Ihsan itu ialah kamu menyembah Allah SWT seolah-olah kamu melihat-Nya. Sekiranya kamu tidak dapat melihat-Nya, sesungguhnya Dia melihatmu. Lelaki itu bertanya lagi: Terangkan aku tentang kiamat. Baginda bersabda: Tiada seorang pun yang mengetahui perihal hari kiamat sama ada orang yang bertanya (malaikat) atau orang yang ditanya (Rasulullah SAW). Lelaki itu berkata: Maka terangkan aku tentang tanda-tandanya. Baginda bersabda: (Antara tandanya) apabila seorang hamba perempuan melahirkan tuannya dan apabila kamu melihat orang fakir yang berkaki ayam, tidak sempurna pemakaian dan hanya menjadi penggembala kambing berlumba-lumba membina bangunan (bertukar menjadi kaya-raya). Kemudian, lelaki itu berlalu. Selang beberapa hari, Baginda bertanya: Wahai, Umar! Tahukah kamu siapakah lelaki yang bertanya itu? Aku berkata: Allah SWT dan rasul-Nya lebih mengetahui. Baginda bersabda: Sesungguhnya dia ialah Malaikat Jibrail yang datang mengajarkan agama kamu. ",
        "ar": "يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الإِسْلَامِ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللهِ عَلَيْهِ وَسَلَّمَ: الإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إِلٰهَ إِلَّا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا. قَالَ: صَدَقْتَ! فَعَجِبْنَا لَهُ یَسْأَلُهُ وَیُصَدِّقُهُ. قَالَ: فَأَخْبِرْنِي عَنِ الْإِیْمَانِ؟ قَالَ: أَنْ تُؤْمِنَ بِاللهِ، وَمَلَائِكَتِهِ، وَكُتُبِهِ، وَرُسُلِهِ، وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ.  قَالَ: صَدَقْتَ! قَالَ: فَأَخْبِرْنِي عَنِ الْإِحْسَانِ؟ قَالَ: أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ یَرَاكَ. قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ؟ قَالَ: مَا الْمَسْؤُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ. قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا؟ قَالَ: أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ یَتَطَاوَلُونَ فِي الْبُنْيَانِ، ثُمَّ انْطَلَقَ، فَلَبِثْتُ مَلِيًّا،  ثُمَّ قَالَ: یَا عُمَرُ، أَتَدْرِي مَنِ السَّائِلُ؟ قُلْتُ: اللهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: فَإِنَّهُ جِبْرِیلُ أَتَاكُمْ یُعَلِّمُكُمْ دِینَكُمْ!"
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Agama yang benar di sisi Allah SWT ialah Islam.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Islam terbina atas tiga tonggak utama, iaitu rukun lslam, rukun iman dan ihsan. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Rukun lslam terdiri daripada lima perkara, iaitu mengucap dua kalimah syahadah, mendirikan solat lima waktu, membayar zakat, berpuasa pada bulan Ramadan dan mengerjakan haji.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Rukun iman terdiri daripada enam perkara, iaitu beriman kepada Allah SWT, para malaikat, kitab-kitab, para rasul, hari kiamat serta qadar baik dan qadar buruk.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Konsep ihsan mendidik manusia supaya menyedari bahawa Allah SWT sentiasa mengawasi setiap amalan yang dilakukan.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "llmu dalam lslam mestilah dipelajari secara berguru, beradab dan berdasarkan panduan yang betul. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Hari kiamat ialah peristiwa besar yang menjadi  satu daripada rukun iman dan tiada sesiapa pun yang mengetahui waktu berlakunya hari kiamat kecuali Allah SWT. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Umar r.a.: Pada suatu hari, ketika kami sedang duduk di sisi Rasulullah SAW, tiba-tiba muncul di hadapan kami seorang lelaki yang memakai pakaian putih bersih, berambut hitam, yang tidak nampak pada dirinya kesan-kesan dan tanda musafir, malah tiada seorang pun dalam kalangan kami yang mengenalinya. Dia duduk menghampiri Nabi Muhammad SAW lalu disandarkan kedua-dua lututnya ke lutut Baginda dan meletakkan kedua-dua tapak tangannya di atas dua pahanya lalu berkata:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 3,
    "hadith_title": {
      "ms": "Rukun Islam",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم)",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Agama lslam terbina atas lima perkara: Bersaksi tiada Tuhan melainkan Allah dan Muhammad utusan Allah, mendirikan solat, mengeluarkan zakat, menunaikan haji di Baitullah dan berpuasa pada bulan Ramadan.” ",
        "ar": "بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلٰهَ إِلَّا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَإِقَامِ الصَّلَاةِ، وَإِیتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Konsep penyaksian ialah keyakinan yang jitu terhadap Allah SWT dan Rasulullah SAW.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Lima rukun Islam ini wajib dilaksanakan oleh setiap mukalaf. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Abdul Rahman Abdullah bin Umar bin al-Khattab r.a.: Aku mendengar Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 4,
    "hadith_title": {
      "ms": "Penciptaan Manusia dan Pengakhirannya",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم) ",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sesungguhnya setiap orang dalam kalangan kamu dihimpunkan kejadiannya di dalam perut ibunya selama 40 hari berupa air mani. Kemudian, menjadi segumpal darah selama tempoh yang sama. Seterusnya, menjadi seketul daging selama tempoh yang sama. Setelah itu, diutuskan kepadanya seorang malaikat lalu ditiupkan roh kepadanya. Malaikat itu diperintahkan mencatat empat perkara, iaitu rezeki, ajal, amalan dan sama ada manusia itu sengsara atau bahagia. Demi Allah SWT yang tiada Tuhan selain-Nya, seseorang yang beramal dengan amalan ahli syurga hingga jaraknya dengan syurga ialah sehasta, lalu ketentuan takdir mendahuluinya. Dia mengerjakan amalan ahli neraka lalu masuklah dia ke neraka. Seseorang yang beramal dengan amalan ahli neraka hingga jaraknya dengan neraka ialah sehasta, lalu ketentuan takdir mendahuluinya. Dia mengerjakan amalan ahli syurga, lalu masuklah dia ke syurga. ",
        "ar": "إِنَّ أَحَدَكُمْ یُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ یَوْمًا نُطْفَةً، ثُمَّ یَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمََّ یَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمََّ یُرْسَلُ إِلَيْهِ الْمَلَكُ فَيَنْفُخُ فِيْهِ الرُّوحَ وَیُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ؛ بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٌّ أَوْ سَعِيدٌ. فَوَاللهِ الَّذِي لَا إِلٰهَ غَيْرُهُ إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ اْلجَنََّةِ حَتَّى مَا یَكُونُ بَيْنـَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكتِاَبُ، فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتََّى مَا یَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنََّةِ فَيَدْخُلُهَا."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Proses kejadian manusia menjadi bukti kekuasaan Allah SWT dan disokong melalui  kajian sains.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Empat takdir hidup manusia, iaitu rezeki, kematian, amalan dan nasibnya telah ditetapkan oleh Allah SWT sejak dilahirkan. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Nasib manusia di akhirat sama ada ditempatkan di dalam syurga atau neraka bergantung pada amalannya.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap manusia perlu istiqamah mengerjakan amalan baik dan menghindari amalan buruk sehingga akhir hayat.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Abdul Rahman Abdullah bin Mas‘ud r.a., Rasulullah SAW yang benar lagi dipercayai  bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 5,
    "hadith_title": {
      "ms": "Amalan yang Tertolak",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم)",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim)"
      },
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sesiapa yang mengada-adakan sesuatu perkara yang bukan daripada ajaran agama kita, maka perkara itu tertolak.",
        "ar": "مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ"
      },
      {
        "en": "",
        "ms": "Dalam satu riwayat Muslim: Sesiapa yang mengerjakan suatu amalan yang tidak ada asal usul dalam agama kita, maka perkara itu tertolak.",
        "ar": "وفِي رِوَايَةِ لِمُسْلِمٍ: مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Islam ialah agama yang sempurna.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap Muslim mestilah menjauhkan diri daripada perbuatan bidaah.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Bidaah ialah perbuatan mencipta atau menambah amalan yang tidak mengikuti sunah atau menyalahi sunah.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat Islam dituntut mengamalkan sunah dan menghindari bidaah.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Umulmukminin Umm Abdullah Aisyah r.a., Rasulullah SAW bersabda:",
        "ar": ""
      },
      {
        "en": "",
        "ms": "",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 6,
    "hadith_title": {
      "ms": "Halal dan Haram",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم)",
        "en": "",
        "ms": " (Riwayat al-Bukhari dan Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Perkara yang halal amat jelas dan perkara yang haram amat jelas. Antara halal dengan haram ada perkara syubhah (kesamaran) yang kebanyakan orang tidak mengetahuinya. Sesiapa yang menjauhi perkara syubhah, dia telah menjaga kesucian agama dan maruah diri. Sesiapa yang melakukan perkara syubhah, dia telah menghampiri perkara haram, umpama seorang penggembala yang menggembala di sekeliling kawasan larangan, dibimbangi dia akan menceroboh masuk. Ketahuilah setiap raja ada sempadan dan sesungguhnya sempadan Allah SWT ialah perkara yang diharamkan-Nya. Ketahuilah dalam setiap jasad itu ada seketul daging. Apabila baik, baiklah seluruh jasad. Apabila rosak, rosaklah seluruh jasad. Itulah hati.",
        "ar": "إِنَّ الْحَلَالَ بَيِّنٌ وَإِنَّ الْحَرَامَ بَيِّنٌ وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ لَا یَعْلَمُهُنَّ كَثِيرٌ مِنَ النَّاسِ، فَمَنِ اتَّقَى الشُّبُهَاتِ، فَقَدِ اسْتَبْرَأَ لِدِیْنِهِ، وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي یَرْعَى حَوْلَ الْحِمَى، یُوشِكُ أَنْ یَرْتَعَ فِيهِ، أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى الله ِمَحَارِمُهُ. أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Seseorang Muslim mestilah melakukan perkara yang halal dan meninggalkan perkara yang haram dan syubhah. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Ilmu tentang halal dan haram perlulah dipelajari oleh umat Islam.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat Islam perlu memelihara hati kerana hati menjadi penentu perbuatan baik dan buruk. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Abdullah al-Nu‘man bin Basyir r.a.: Aku mendengar Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 7,
    "hadith_title": {
      "ms": "Agama Itu Nasihat",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Agama itu nasihat. Kami bertanya: Untuk siapa? Baginda bersabda: Untuk Allah, untuk kitab-Nya, untuk rasul-Nya, untuk pemimpin umat Islam dan untuk umat lslam seluruhnya.",
        "ar": "الدِّینُ النَّصِيحَةُ. قُلْنَا: لِمَنْ؟ قَالَ: لِلهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ، وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Nasihat dalam hadis ini bermaksud melaksanakan tanggungjawab dan kewajipan terhadap Allah SWT, al-Quran, Rasulullah SAW, pemimpin dan seluruh umat Islam.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Kejayaan umat Islam bergantung pada hubungan dengan Allah SWT dan hubungan dengan manusia.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Ruqaiyyah Tamim bin Aus al-Dari r.a., Nabi Muhammad SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 8,
    "hadith_title": {
      "ms": "Kehormatan Muslim",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم)",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Aku diperintahkan supaya memerangi (penentangan) manusia sehingga mereka (sendiri) bersaksi bahawa tiada Tuhan melainkan Allah dan bahawa  Muhammad pesuruh Allah, mereka mendirikan solat dan menunaikan zakat. Apabila mereka menunaikan perkara tersebut, mereka telah memelihara darah dan harta mereka daripada (tindakan yang diperintahkan kepada) aku melainkan dengan hak (yang dibenarkan oleh) lslam. Selebihnya, perhitungan terhadap mereka diserahkan kepada Allah SWT. ",
        "ar": "أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ، حَتَّى یَشْهَدُوا أَنْ لَا إِلٰهَ إِلَّا اللهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَیُقِيمُوا الصَّلَاةَ، وَیُؤْتُـوا الزَّكَاةَ، فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلَّا بِحَقِّ الْإِسْلَامِ وَحِسَابُهُمْ عَلَى اللهِ تَعَالَى."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Misi dakwah Rasulullah SAW adalah untuk menegakkan akidah lslam dan membanteras syirik. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Islam tidak memaksa seseorang untuk menganut agama Islam.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "lslam menjamin hak pemeliharaan dan perlindungan jiwa, harta dan maruah diri orang Islam dan orang bukan Islam. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Jaminan hak dalam Islam terbatal apabila berlaku pelanggaran terhadap dasar dan undang-undang Islam.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada lbn Umar r.a., bahawa Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 9,
    "hadith_title": {
      "ms": "Taati Perintah Rasulullah SAW",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم)",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Perkara yang aku larang, jauhilah. Perkara yang aku perintahkan, lakukanlah sedaya upaya kamu. Umat yang terdahulu telah binasa lantaran banyak persoalan dan pertikaian terhadap nabi-nabi mereka.",
        "ar": "مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِینَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ، عَلَى أَنْبِيَائِهِمْ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Seorang Muslim wajib menjauhi semua larangan Rasulullah SAW.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Seorang Muslim perlu melaksanakan segala suruhan Rasulullah SAW dengan sedaya upaya.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Nabi Muhammad SAW mengingatkan umatnya supaya tidak bertanya perkara yang sia-sia.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat Islam dilarang mempertikaikan ajaran Rasulullah SAW. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Hurairah Abdul Rahman bin Sakhr r.a.: Aku mendengar Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 10,
    "hadith_title": {
      "ms": "Syarat Doa  Dimakbulkan",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sesungguhnya Allah SWT Maha Baik, Dia tidak menerima kecuali sesuatu yang baik. Dan sesungguhnya, Allah SWT telah memerintahkan kepada orang yang beriman dengan perintah yang sama kepada para rasul-Nya. Allah SWT juga berfirman yang bermaksud:\n\nWahai, para rasul! Makanlah daripada benda-benda yang baik dan kerjakanlah amalan yang soleh ... (Surah al-Mukminun 23:51). \n\nAllah SWT juga berfirman yang bermaksud: \n\nWahai, orang yang beriman! Makanlah daripada benda-benda yang baik yang Kami kurniakan kepada kamu ... (Surah al-Baqarah 2:172). \n\nKemudian, Baginda menceritakan perihal seseorang yang menempuh perjalanan jauh, rambutnya kusut-masai dan berdebu, dia menadah kedua-dua tangannya ke langit sambil berdoa: Wahai, Tuhanku! Wahai, Tuhanku! Sedangkan makanannya haram, minumannya haram, pakaiannya haram dan dia diberi makan dengan makanan yang haram. Bagaimanakah diperkenankan doa orang yang sedemikian?",
        "ar": "إِنَّ اللهَ طَيِّبٌ لَا یَقْبَلُ إِلَّا طَيِّبًا، وَإِنَّ اللهَ أَمَرَ الْمُؤْمِنِينَ بِـمَا أَمَرَ بِهِ الْمُرْسَلِينَ،\nفَقَالَ تَعَالَى:﴿يَـٰٓأَيُّهَا ٱلرُّسُلُ كُلُوا۟ مِنَ ٱلطَّيِّبَـٰتِ وَٱعْمَلُوا۟ صَـٰلِحًا ۖ...﴾ وَقَالَ تَعَالَى: ﴿يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُلُوا۟ مِن طَيِّبَـٰتِ مَا رَزَقْنَـٰكُمْ... ﴾\nثُمَّ ذَكَرَ الرَّجُلَ یُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ یَمُدُّ یَدَیْهِ إِلَى السَّمَاءِ: یَا رَبِّ! یَا رَبِّ! وَمَطْعَمُهُ حَرَامٌ،  وَمَشْرَبُهُ حَرَامٌ، وَمَلْبَسُهُ حَرَامٌ، ْوَغُذِيَ بِالْحَرَامِ، فَأَنَّى یُسْتَجَابُ لَهُ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Pemakanan yang baik dan halal mendorong seseorang Muslim melakukan perbuatan yang baik.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Pemakanan yang haram mendorong seseorang Muslim melakukan perbuatan yang buruk.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Allah SWT tidak membezakan perintah-Nya kepada para rasul dan orang yang beriman dalam urusan makan dan minum.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Doa seseorang Muslim tidak dimakbulkan oleh Allah SWT kerana pemakanan dan perbuatan yang haram.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Hurairah r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 11,
    "hadith_title": {
      "ms": "Tinggalkan Keraguan",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه الترمذي والنسائي وقال الترمذي: حديث حسن صحيح.) ",
        "en": "",
        "ms": "(Riwayat al-Tirmizi dan al-Nasa’i. Menurut al-Tirmizi, hadis ini hasan sahih.) "
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Tinggalkanlah perkara yang meragukan kepada perkara yang tidak meragukan.",
        "ar": "دَعْ مَا یَرِیبُكَ إِلَى مَا لَا یَرِیبُكَ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Umat Islam disarankan supaya meninggalkan perkara yang meragukan demi menjaga maruah diri dan kesucian agama. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Perkara yang meragukan boleh menyebabkan seorang itu terjebak dalam perkara yang haram. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Amalan yang dilakukan dengan penuh keyakinan akan diberikan ganjaran pahala.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Muhammad al-Hasan bin Ali bin Abu Talib r.a., cucu Rasulullah SAW berkata: Aku telah menghafaz sabda Rasulullah SAW:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 12,
    "hadith_title": {
      "ms": "Tinggalkan Perkara yang Tidak Berfaedah",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(حديث حسن رواه الترمذي وغيره هكذا.) ",
        "en": "",
        "ms": "(Hadis hasan. Riwayat al-Tirmizi dan lain-lain yang seumpamanya.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Antara keindahan Islam pada diri seseorang termasuklah dengan meninggalkan perkara yang tidak mendatangkan faedah bagi dirinya.",
        "ar": "مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا یَعْنِيهِ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Seseorang Muslim mestilah melaksanakan peranan dan tanggungjawab masing-masing.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat Islam dilarang mencampuri urusan orang lain yang tidak mendatangkan faedah bagi dirinya.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Hurairah r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 13,
    "hadith_title": {
      "ms": "Tanda Kesempurnaan Iman",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم)",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Tidak sempurna iman seseorang itu sehingga dia mengasihi saudaranya sebagaimana dia mengasihi dirinya sendiri.",
        "ar": "لَا یُؤْمِنُ أَحَدُكُمْ حَتَّى یُحِبَّ لِأَخِيهِ مَا یُحِبُّ لِنَفْسِهِ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Kasih sayang dan ukhuwah amat dituntut dalam Islam. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap Muslim hendaklah bersikap prihatin terhadap saudara seagama sebagaimana dia mengambil berat akan dirinya. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Tidak akan sempurna iman seseorang sekiranya wujud perasaan benci terhadap saudara seagama. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Kasih sayang dan ukhuwah yang utuh dalam kalangan umat lslam menjadi kunci kekuatan umat lslam. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Hamzah Anas bin Malik r.a., khadam (pembantu) Rasulullah SAW, Baginda bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 14,
    "hadith_title": {
      "ms": "Larangan Berzina, Membunuh dan Murtad",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم)",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Tidak halal (menumpahkan) darah seseorang Muslim, kecuali disebabkan satu daripada tiga perkara; berzina setelah berkahwin, membunuh orang (tanpa hak) dan meninggalkan agama serta memisahkan diri daripada jemaah orang Islam.",
        "ar": "لَا یَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ: الثَّيِّبُ الزَّانِي، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّارِكُ لِدِینِهِ الْمُفَارِقُ لِلْجَمَاعَةِ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Islam menjamin keselamatan setiap Muslim dari aspek maruah, nyawa dan agama.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat Islam wajib memelihara maruah dengan tidak berzina, memelihara nyawa dengan tidak membunuh dan memelihara agama dengan tidak murtad. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Pelaksanaan hukuman jenayah hendaklah berdasarkan perundangan negara. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada lbn Mas‘ud r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 15,
    "hadith_title": {
      "ms": "Sifat Mulia Mukmin",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم)",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sesiapa yang beriman dengan Allah SWT dan hari akhirat, hendaklah dia bercakap perkara yang baik atau diam. Sesiapa yang beriman dengan Allah SWT dan hari akhirat, hendaklah dia memuliakan jiran tetangganya. Sesiapa yang beriman dengan Allah SWT dan hari akhirat, hendaklah dia memuliakan tetamunya.",
        "ar": "مَنْ كَانَ یُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ یُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ یُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Ciri utama orang yang beriman dengan Allah SWT dan hari akhirat adalah dengan menjaga percakapan, menunaikan hak jiran dan memuliakan tetamu.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Keamanan, kemajuan dan keharmonian dalam masyarakat dapat dicapai melalui perhubungan yang baik sesama manusia.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Hurairah r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 16,
    "hadith_title": {
      "ms": "Hindari Sifat Marah",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري)",
        "en": "",
        "ms": "(Riwayat al-Bukhari)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Janganlah marah. Lelaki itu mengulangi soalan itu beberapa kali. Baginda tetap bersabda: Janganlah marah.",
        "ar": "لَا تَغْضَبْ. فَرَدَّدَ مِرَارًا، قَالَ: لَا تَغْضَبْ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Setiap Muslim perlu menghindari sifat marah.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Sifat marah bukan sahaja memberikan kesan yang sangat buruk kepada individu, malah kepada orang lain.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat Islam dituntut supaya menahan kemarahan untuk mengelakkan perbuatan negatif.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Kekuatan sebenar individu dapat dilihat pada kemampuannya menahan marah.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Marah dibenarkan jika melibatkan keadaan tertentu seperti mempertahankan agama Islam dan membela Allah SWT serta Rasulullah SAW.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Hurairah r.a., seorang lelaki berkata kepada Nabi Muhammad SAW: Nasihati aku. Baginda bersabda: ",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 17,
    "hadith_title": {
      "ms": "Ihsan dalam  Pelaksanaan",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sesungguhnya Allah SWT mewajibkan sifat ihsan atas segala sesuatu. Apabila kamu membunuh (qisas dan peperangan), laksanakanlah dengan cara yang terbaik. Apabila kamu menyembelih (haiwan), sembelihlah dengan cara yang baik dan hendaklah kamu menajamkan mata pisau supaya tidak menyeksa haiwan itu.",
        "ar": "إِنَّ اللهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيحَتَهُ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Ihsan dalam hadis ini bermaksud melaksanakan  hukuman dan penyembelihan haiwan dengan cara paling baik.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Rasulullah SAW menetapkan adab dan etika dalam peperangan. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Ihsan tidak hanya terhad dengan berbuat baik kepada manusia, malah melibatkan makhluk lain seperti haiwan bagi mengelakkan kezaliman.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Ya‘la Syaddad bin Aus r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 18,
    "hadith_title": {
      "ms": "Takwa dan  Akhlak Mulia",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه الترمذي وقال حديث حسن، وفي بعض النسخ: حسن صحيح.)",
        "en": "",
        "ms": "(Riwayat al-Tirmizi. Menurut al-Tirmizi, hadis ini hasan. Pada sebahagian naskhah tertulis, hadis ini hasan sahih.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Bertakwalah kepada Allah SWT walau di mana-mana sahaja. Susulilah kejahatan dengan kebaikan, nescaya kebaikan itu akan menghapuskan kejahatan tersebut. Bergaullah sesama manusia dengan budi pekerti yang baik.",
        "ar": "اِتَّقِ اللهَ حَيثُمَا كُنْتَ، وَأَتْبِعِ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Setiap Muslim dituntut supaya sentiasa bertakwa.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Sifat takwa mencegah seseorang Muslim daripada melakukan kemungkaran dan kemaksiatan.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Kejahatan dapat dihapuskan dengan kebaikan yang dilakukan selepasnya.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Keharmonian dan kesejahteraan dalam masyarakat akan terhasil daripada akhlak yang baik.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Zar Jundub bin Junadah dan Abu Abdul Rahman Muaz bin Jabal r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 19,
    "hadith_title": {
      "ms": "Yakin dan Bertawakal kepada Allah SWT",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه الترمذي. وقال حديث حسن صحيح.)",
        "en": "",
        "ms": "(Riwayat al-Tirmizi. Menurut al-Tirmizi, hadis ini hasan sahih.)"
      },
      {
        "ar": "",
        "en": "",
        "ms": ""
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Wahai, anak! Sesungguhnya aku mahu mengajarmu beberapa kalimah: Peliharalah hak  Allah SWT, nescaya Allah SWT akan memeliharamu. Peliharalah hak Allah SWT, nescaya Allah SWT akan memberikan petunjuk kepadamu. Apabila kamu meminta, mintalah daripada Allah SWT. Apabila kamu meminta pertolongan, mintalah pertolongan daripada Allah SWT. Ketahuilah, jika umat ini berkumpul untuk memberikan manfaat kepadamu, mereka tidak mampu memberimu manfaat, kecuali dengan perkara yang ditentukan oleh Allah SWT untukmu. Sekiranya mereka berkumpul untuk memudaratkan kamu dengan sesuatu mudarat, nescaya mereka tidak mampu memudaratkan kamu, kecuali dengan perkara yang ditentukan oleh Allah SWT untukmu. Pena-pena telah diangkatkan dan lembaran-lembaran telah kering (dakwatnya).",
        "ar": "یَا غُلَامُ! إِنِّي أُعَلِّمُكَ كَلِمَاتٍ: اِحْفَظِ اللهَ  یَحْفَظْكَ، اِحْفَظِ اللهَ تَجِدْهُ تُجَاهَكَ، إِذَا سَأَلْتَ فَاسْأَلِ اللهَ، وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللهِ، وَاعْلَمْ أَنَّ الْأُمَّةَ لَوِ اجْتَمَعَتْ عَلَى أَنْ یَنْفَعُوكَ بِشَيْءٍ لَمْ یَنْفَعُوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللهُ لَكَ، وَإِنِ اجْتَمَعُوْا عَلَى أَنْ یَضُرُّوكَ بِشَيْءٍ، لَمْ یَضُرُّوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللهُ عَلَيْكَ، رُفِعَتِ الْأَقْلَامُ وَجَفَّتِ الصُّحُفُ."
      },
      {
        "en": "",
        "ms": "Peliharalah hak Allah SWT, nescaya Allah SWT akan memberikan petunjuk kepadamu. Ingatlah Allah SWT ketika senang, nescaya Dia akan mengingatimu ketika susah. Ketahuilah, perkara yang ditakdirkan tidak akan menimpamu, pasti tidak akan menimpamu. Perkara yang ditakdirkan menimpamu, pasti akan menimpamu. Ketahuilah, kemenangan itu hadir daripada kesabaran, kelapangan hadir daripada kesempitan dan kesenangan hadir daripada kesusahan.",
        "ar": "اِحْفَظِ اللهَ تَجِدْهُ أَمَامَكَ، تَعَرَّفْ إِلَى اللهِ فِي الرَّخَاءِ یَعْرِفْكَ فِي الشِّدَّةِ، وَاعْلَمْ أَنَّ مَا أَخْطَأَكَ لَمْ یَكُنْ لِيُصِيبَكَ، وَمَا أَصَابَكَ لَمْ یَكُنْ لِيُخْطِئَكَ، وَاعْلَمْ أَنَّ النَّصْرَ مَعَ الصَّبْرِ، وَأَنَّ الْفَرَجَ مَعَ الْكَرْبِ، وَأَنَّ مَعَ الْعُسْرِ یُسْرًا."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Setiap Muslim dituntut supaya menjaga dan memelihara hak Allah SWT.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap permintaan hendaklah ditujukan kepada Allah SWT sahaja. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Hanya Allah SWT yang berkuasa dan mampu memperbaik keadaan hamba-Nya bergantung pada usahanya.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Ketentuan Allah SWT kepada setiap manusia sudah tertulis di lohmahfuz dan tidak akan berubah. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu al-Abbas, Abdullah bin Abbas r.a.: Aku pernah duduk di belakang Nabi Muhammad SAW pada suatu hari, lalu Baginda bersabda kepadaku:",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Dalam riwayat selain al-Tirmizi:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 20,
    "hadith_title": {
      "ms": "Malu kerana Allah SWT",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري)",
        "en": "",
        "ms": "(Riwayat al-Bukhari)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Antara pesanan para nabi terdahulu yang diketahui oleh manusia termasuklah jika kamu tidak malu, lakukanlah apa-apa yang kamu mahu.",
        "ar": "إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى:إِذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْتَ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Malu dalam hadis ini bermaksud malu untuk melakukan maksiat dan malu untuk meninggalkan perintah Allah SWT.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Sifat malu mesti ada pada diri setiap Muslim.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Malu ialah perisai yang dapat melindungi diri daripada melakukan perkara tidak baik.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Mas‘ud Uqbah bin Amru al-Ansari    al-Badri r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 21,
    "hadith_title": {
      "ms": "Iman dan Istiqamah",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Wahai, Rasulullah! Ajarilah aku suatu ucapan dalam lslam yang aku tidak perlu lagi bertanya kepada orang lain. Baginda bersabda: Ucapkanlah: Aku beriman kepada Allah SWT, kemudian istiqamah. ",
        "ar": "یَا رَسُولَ اللهِ! قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا غَيْرَكَ؟ قَالَ: قُلْ آمَنْتُ بِاللهِ ثُمَّ اسْتَقِمْ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Islam menuntut umatnya supaya sentiasa mengikrarkan keimanan kepada Allah SWT dengan istiqamah.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Keimanan kepada Allah SWT akan tergugat tanpa istiqamah.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu ‘Amru (digelar juga Abu ‘Amrah),  Sufian bin Abdullah r.a. berkata: ",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 22,
    "hadith_title": {
      "ms": "Syarat ke Syurga",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم) (ومعنى حَرَّمْتُ الحرام: اجتنبه، ومعنى أحللت الحلال: فعلته معتقدا حله.)",
        "en": "",
        "ms": "(Riwayat Muslim) (Maksud aku mengharamkan perkara yang haram ialah aku menjauhinya. Maksud aku menghalalkan perkara yang halal ialah aku melaksanakannya dengan meyakini kehalalannya.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Bagaimanakah pandanganmu jika aku mendirikan solat fardu, aku berpuasa pada bulan Ramadan, aku menghalalkan perkara yang halal dan aku mengharamkan perkara yang haram? Aku tidak akan menambahkan apa-apa lagi lebih daripada itu. Adakah aku akan masuk syurga? Baginda bersabda: Ya! ",
        "ar": "أَرَأَیْتَ إِذَا صَلَّيْتُ الْمَكْتُوبَاتِ وَصُمْتُ رَمَضَانَ، وَأَحْلَلْتُ الْحَلَالَ، وَحَرَّمْتُ الْحَرَامَ، وَلَمْ أَزِدْ عَلَى ذَلِكَ شَيْئًا، أَأَدْخُلُ الْجَنَّةَ؟ قَالَ: نَعَمْ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Solat lima waktu, berpuasa pada bulan Ramadan, menghalalkan yang halal dan mengharamkan yang haram ialah amalan yang mendapat jaminan syurga.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Amalan yang sedikit tetapi berkualiti lebih baik daripada amalan yang banyak tetapi tidak berkualiti.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Abdullah Jabir bin Abdullah al-Ansari r.a., seorang lelaki bertanya kepada Rasulullah SAW lalu berkata:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 23,
    "hadith_title": {
      "ms": "Ganjaran Amalan  Soleh",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Kebersihan sebahagian daripada iman. Zikir alhamdulillah memenuhi timbangan. Zikir subhanallah dan alhamdulillah memenuhi ruangan antara langit dengan bumi. Solat itu cahaya. Sedekah itu bukti. Sabar itu sinaran. Al-Quran ialah hujah bagimu atau hujah terhadapmu. Setiap manusia keluar pada waktu pagi, ada yang menjual dirinya (melakukan ketaatan atau kemungkaran) lalu ada yang memerdekakan dirinya (daripada kehinaan di dunia dan azab di akhirat) dan ada pula yang membinasakan dirinya (dengan melakukan maksiat). ",
        "ar": " الطُّهُورُ شَطْرُ الْإِیمَانِ، وَالْحَمْدُ لِلهِ تَمْلَأُ الْمِيزَانَ، وَسُبْحَانَ اللهِ وَالْحَمْدُ لِلهِ تَمْلَآنِ أَوْ تَمْلَأُ مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ، وَالصَّلَاةُ نُورٌ، وَالصَّدَقَةُ بُرْهَانٌ، وَالصَّبْرُ ضِيَاءٌ، وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ. كُلُّ النَّاسِ یَغْدُو فَبَائِعٌ نَفْسَهُ فَمُعْتِقُهَا أَوْ مُوبِقُهَا."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "lslam amat menitikberatkan kebersihan kerana kebersihan sebahagian daripada iman.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Semua zikir dan amalan soleh mempunyai kebaikan dan ganjaran pahala yang besar bagi seseorang Muslim.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap manusia mempunyai pilihan sama ada untuk melakukan kebaikan atau keburukan.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Malik al-Haris bin ‘Asim al-Asy‘ari r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 24,
    "hadith_title": {
      "ms": "Keagungan dan Rahmat  Allah SWT",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Wahai, hamba-Ku! Aku mengharamkan atas diri-Ku kezaliman dan Aku jadikannya dalam kalangan kamu sebagai suatu perkara yang diharamkan, maka janganlah kamu saling menzalimi. \nWahai, hamba-Ku! Kamu semua sesat kecuali orang yang Aku hidayahkannya, maka hendaklah kamu meminta hidayah daripada-Ku. \nWahai, hamba-Ku! Kamu semua lapar kecuali orang yang Aku berikan makanan, maka hendaklah kamu meminta makanan daripada-Ku, nescaya Aku akan memberi kamu makanan. \nWahai, hamba-Ku! Kamu semua tidak berpakaian kecuali orang yang Aku berinya pakaian, maka hendaklah kamu meminta pakaian daripada-Ku, nescaya Aku akan memberi kamu pakaian. \nWahai, hamba-Ku! Sesungguhnya kamu berbuat dosa siang dan malam dan Aku mengampunkan semua dosa, maka mintalah keampunan daripada-Ku, nescaya Aku akan mengampunkan kamu. \nWahai, hamba-Ku! Selama-lamanya kamu tidak akan mampu memudaratkan Aku hingga kamu boleh memudaratkan Aku. \nWahai, hamba-Ku! Selama-lamanya kamu tidak akan mampu memberikan manfaat kepada Aku sehingga kamu boleh memberikan manfaat kepada-Ku. \nWahai, hamba-Ku! Sekiranya seluruh manusia dan jin yang terdahulu dan terkemudian mempunyai ketakwaan pada tahap yang paling tinggi yang pernah dimiliki oleh seseorang hamba, nescaya hal itu tidak memberikan nilai tambah dalam kerajaan-Ku. \nWahai, hamba-Ku! Sekiranya seluruh manusia dan jin yang terdahulu dan terkemudian mempunyai kejahatan pada tahap yang paling tinggi yang pernah dimiliki oleh seseorang hamba, nescaya hal itu tidak mengurangkan nilai kerajaan-Ku. \nWahai, hamba-Ku! Sekiranya seluruh manusia dan jin yang terdahulu dan terkemudian berhimpun di suatu tempat lalu mereka meminta daripada-Ku, lantas Aku kurniai setiap orang permintaannya, nescaya hal itu tidak mengurangkan sedikit pun nilai kerajaan-Ku kecuali umpama berkurangnya air laut apabila dicelupkan sebatang jarum. \nWahai, hamba-Ku! Hanya amalan kamu yang akan Aku perhitungkan, kemudian akan Aku sempurnakan pembalasannya. Sesiapa yang mendapat kebaikan, hendaklah dia memuji Allah SWT. Sesiapa yang mendapat selain kebaikan, janganlah dia mencela kecuali mencela dirinya sendiri.",
        "ar": "َا عِبَادِي! إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي، وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلَا تَظَالَمُوا، یَا عِبَادِي! كُلُّكُمْ  ضَالٌّ إِلَّا مَنْ هَدَیْتُهُ فَاسْتَهْدُونِي أَهْدِكُمْ، یَا عِبَادِي! كُلُّكُمْ جَائِعٌ إِلَّا مَنْ أَطْعَمْتُهُ فَاسْتَطْعِمُونِي أُطْعِمْكُمْ، یَا عِبَادِي! كُلُّكُمْ عَارٍ إِلَّا مَنْ كَسَوْتُهُ فَاسْتَكْسُوْنِي أَكْسُكُمْ، یَا عِبَادِي! إِنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ وَأَناَ أَغْفِرُ الذُّنُوبَ جَمِيعًا، فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ، یَا عِبَادِي! إِنَّكُمْ لَنْ تَبْلُغُوْا ضُرِّي فَتَضُرُّونِي وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي، یَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا، یَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا، یَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُو فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي، فَأَعْطَيْتُ كُلَّ إِنسَانٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إِلَّا كَمَا یَنْقُصُ الْمِخْيَطُ إِذَا أُدْخِلَ الْبَحْرَ، یَا عِبَادِي! إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ، ثُمَّ أُوَفِّيكُمْ إِیَّاهَا، فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدِ اللهَ، وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا یَلُومَنَّ إِلَّا نَفْسَهُ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Allah SWT mengharamkan hamba-Nya bersikap zalim.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Allah SWT memberikan petunjuk, rezeki dan keperluan hidup kepada seluruh makhluk. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Allah SWT akan mengampunkan segala dosa hamba-Nya melainkan dosa syirik.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Semua hamba bergantung pada rahmat dan kasih sayang Allah SWT.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap perbuatan manusia atau jin sama ada baik atau buruk, tidak sedikit pun menjejaskan keagungan Allah SWT.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap amalan manusia akan dihitung satu per satu oleh Allah SWT sama ada balasan baik mahupun balasan buruk.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Zar al-Ghifari r.a., berdasarkan riwayat Rasulullah SAW, Allah SWT berfirman:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 25,
    "hadith_title": {
      "ms": "Luasnya Rahmat Allah SWT",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Wahai, Rasulullah! Orang kaya telah mendapat banyak pahala. Mereka solat sebagaimana kami solat, mereka berpuasa sebagaimana kami berpuasa dan mereka bersedekah dengan lebihan harta mereka. Baginda bersabda: Bukankah Allah SWT telah menjadikan bagi kamu sesuatu yang kamu boleh bersedekah dengannya? Sesungguhnya dengan setiap tasbih itu sedekah, setiap takbir itu sedekah, setiap tahmid itu sedekah, setiap tahlil itu sedekah, menyuruh amar makruf itu sedekah, menegah mungkar itu sedekah dan pada kemaluan seseorang daripada kamu pun sedekah. Mereka bertanya: Wahai, Rasulullah! Adakah sekiranya seorang daripada kami mendatangi isteri (jimak) juga mendapat pahala? Baginda bersabda: Apakah pendapat kamu sekiranya dia melepaskan syahwatnya dengan cara yang haram, bukankah dia mendapat dosa? Demikian juga apabila dia melepaskan syahwatnya pada jalan yang halal, dia beroleh pahala.",
        "ar": "یَا رَسُولَ اللهِ ذَهَبَ أَهْلُ الدُّثُورِ بِالْأُجُورِ، یُصَلُّونَ كَمَا نُصَلِّي وَیَصُومُونَ كَمَا نَصُومُ وَیَتَصَدَّقُونَ بِفُضُولِ أَمْوَالِهِمْ، قَالَ: أَوَلَيْسَ قَدْ جَعَلَ اللهُ لَكُمْ مَا تَصَدَّقُونَ؟ إِنَّ لَكُمْ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً، وَكُلِّ تَكْبِيرَةٍ صَدَقَةً، وَكُلِّ تَحْمِيدَةٍ صَدَقَةً، وَكُلِّ تَهْلِيلَةٍ صَدَقَةً، وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ، وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ، وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ. قَالُوا: یَا رَسُولَ اللهِ أَیَأْتِي أَحَدُنَا شَهْوَتَهُ وَیَكُونُ لَهُ فِيهَا أَجْرٌ؟ قَالَ: أَرَأَیْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ، أَكَانَ عَلَيْهِ وِزْرٌ؟ فَكَذَلِكَ إِذَا وَضَعَهَا فِي الْحَلَالِ كَانَ لَهُ أَجْرٌ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Allah SWT akan memberikan ganjaran dan darjat yang lebih tinggi kepada orang kaya yang suka bersedekah dan beramal soleh. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat Islam yang tidak mempunyai harta untuk bersedekah boleh mendapatkan pahala bersedekah dengan bertasbih, bertakbir, bertahmid dan bertahlil.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Teladani para sahabat Rasulullah SAW yang       berlumba-lumba melakukan amal kebaikan kerana amalan itu mempunyai ganjaran yang besar di sisi Allah SWT.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Zar r.a., beberapa orang sahabat Rasulullah SAW berkata kepada Baginda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 26,
    "hadith_title": {
      "ms": "Kelebihan Sedekah",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم)",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Pada setiap kali matahari terbit, setiap sendi di tubuh manusia menanggung tuntutan sedekah. Perbuatan berlaku adil terhadap dua orang (yang bertelingkah) ialah sedekah. Perbuatan membantu seseorang menaiki kenderaan atau mengangkat barang ke kenderaannya ialah sedekah. Perkataan yang baik ialah sedekah. Setiap langkah untuk menunaikan solat ialah sedekah. Perbuatan mengalihkan sesuatu yang berbahaya di jalan juga ialah sedekah. ",
        "ar": "كُلُّ سُلَامَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ، كُلَّ یَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ، تَعْدِلُ بَيْنَ اثْنَيْنِ صَدَقَةٌ، وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَبِكُلِّ خُطْوَةٍ تَمْشِيهَا إِلَى الصَّلَاةِ صَدَقَةٌ، وَتُمِيطُ الْأَذَى عَنِ الطَّرِیقِ صَدَقَةٌ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Amalan bersedekah adalah antara tanda mensyukuri nikmat Allah SWT. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap amalan baik yang dilakukan dikira sebagai sedekah walaupun sekecil-kecil amalan.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat Islam berpeluang untuk mendapatkan pahala seluas-luasnya dan tidak hanya terbatas kepada amal ibadat khusus.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Hurairah r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 27,
    "hadith_title": {
      "ms": "Kesucian Hati",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      },
      {
        "ar": "(حديث حسن رُوِينَاه في مسندي الإمامين: أحمد بن حنبل والدارمي بإسناد حسن.)",
        "en": "",
        "ms": "(Hadis hasan. Diriwayatkan kepada kami secara bersambung sanad dengan Musnad Imam Ahmad dan Musnad al-Darimi. Sanad ini hasan.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Kebaikan ialah keelokan budi pekerti, manakala dosa ialah kegusaran dalam dirimu dan kamu benci orang lain mengetahuinya. ",
        "ar": "الْبِرُّ حُسْنُ الْخُلُقِ وَالْإِثْمُ مَا حَاكَ فِي نَفْسِكَ وَكَرِهْتَ أَنْ یَطَّلِعَ عَلَيْهِ النَّاسُ."
      },
      {
        "en": "",
        "ms": "Adakah kamu datang untuk bertanya tentang kebaikan dan dosa? Aku berkata: Ya. Baginda bersabda: Tanyalah hatimu. Kebaikan itu ialah sesuatu yang menenteramkan diri dan jiwa, manakala dosa ialah perkara yang menggusarkan diri dan jiwamu, sekalipun ada orang memberikan  pandangan yang salah kepadamu berulang kali.",
        "ar": "جِئْتَ تَسْأَلُ عَنِ الْبِرِّ وَالْإِثْمِ؟ قُلتُ: نَعَمْ، قَالَ: اسْتَفْتِ قَلْبَكَ، الْبِرُّ مَا اطْمَأَنَّتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ، وَالْإِثْمُ مَا حَاكَ فِي النَّفْسِ وَتَرَدَّدَ فِي الصَّدْرِ، وَإِنْ أَفْتَاكَ النَّاسُ وَأَفْتَوْكَ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Fitrah manusia apabila berhadapan dengan kebaikan, hatinya akan menjadi tenang. Sebaliknya jika berhadapan dengan dosa, hatinya akan menjadi gelisah.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Manusia yang sering melakukan dosa dan maksiat tidak lagi berasa gelisah dan bersalah. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap Muslim perlu menghindarkan diri daripada terpengaruh dengan pandangan yang salah.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada al-Nawwas bin Sam‘an r.a., Nabi Muhammad SAW bersabda:",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Daripada Wabisah bin Ma‘bad r.a., beliau berkata: Aku menemui Rasulullah SAW lalu Baginda bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 28,
    "hadith_title": {
      "ms": "Ikuti Sunah Jauhi Bidaah",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه أبو داود والترمذي وقال: حديث حسن صحيح.)",
        "en": "",
        "ms": "(Riwayat Abu Dawud dan al-Tirmizi. Menurut al-Tirmizi, hadis ini hasan sahih.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Aku berpesan supaya kamu bertakwa kepada Allah SWT, dengar dan taat sekalipun kamu diperintahkan oleh seorang hamba. Sesiapa yang masih hidup selepas kewafatanku akan melihat perselisihan yang banyak. Oleh itu, hendaklah kamu mengikuti sunahku dan sunah Khulafa al-Rasyidin yang diberi petunjuk. Gigitlah dengan kuat (berpegang teguhlah pada sunah tersebut) dan hindarilah daripada melakukan perkara yang diada-adakan (dalam agama) kerana setiap bidaah itu sesat.",
        "ar": "أُوْصِيكُمْ بِتَقْوَى اللهِ عَزَّ وَجَلَّ، وَالسَّمْعِ وَالطَّاعَة،ِ ِوَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ فَإِنَّهُ مَنْ یَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلَافًا كَثِيرًا، فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِینَ الْمَهْدِیِّينَ، عَضُّواْ عَلَيْهَا بِالنَّوَاجِذِ، وَإِیَّاكُمْ ومُحْدَثَاتِ الْأُمُورِ، فَإِنَّ كُلَّ بِدْعَةٍ ضَلَالَةٌ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Seorang Muslim hendaklah menyampaikan pengajaran dan peringatan dengan bersungguh-sungguh dan berkesan. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat Islam wajib patuh kepada pemimpin selagi tidak menyalahi syarak.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat Islam mestilah berpegang teguh pada sunah serta menjauhi perkara bidaah untuk mengelakkan perselisihan dan perpecahan.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Najih al-‘lrbadh bin Sariyah r.a., beliau berkata: Rasulullah SAW menasihati kami dengan nasihat yang menggetarkan hati dan menitiskan air mata. Kami berkata: Wahai, Rasulullah! Nasihat itu seolah-olah ucapan selamat tinggal. Berilah kami pesanan. Baginda bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 29,
    "hadith_title": {
      "ms": "Pintu Kebaikan",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه الترمذي وقال: حديث حسن صحيح) ",
        "en": "",
        "ms": "(Riwayat al-Tirmizi. Menurut beliau, hadis ini hasan sahih.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Kamu bertanya suatu perkara besar, namun perkara itu ringan bagi orang yang dipermudah Allah SWT, iaitu kamu menyembah Allah SWT, jangan mensyirikkan-Nya dengan sesuatu, kamu mendirikan solat, menunaikan zakat, berpuasa pada bulan Ramadan dan menunaikan haji. \nKemudian, Baginda bersabda: Mahukah kamu aku tunjukkan beberapa pintu kebaikan? Puasa itu perisai, sedekah dapat memadamkan dosa seumpama air memadamkan api dan solat seorang lelaki pada tengah malam. \nKemudian, Baginda membaca ayat al-Quran yang bermaksud: Mereka menjauhkan diri dari tempat tidur dan sentiasa berdoa kepada Tuhan mereka dengan perasaan takut serta penuh harap dan mereka mendermakan sebahagian daripada apa-apa yang Kami rezekikan kepada mereka. Maka tidak ada seorang pun yang mengetahui akan apa-apa yang telah dirahsiakan untuk mereka yang amat indah dipandang dan menggembirakan sebagai balasan bagi amal-amal soleh yang telah dikerjakan oleh mereka (Surah al-Sajadah 36:16-17). \nKemudian, Baginda bersabda: Mahukah kamu aku khabarkan tonggak segala amal, tiang-tiangnya dan puncaknya? Aku berkata: Ya, Rasulullah! Baginda bersabda: Tonggak amalan ialah lslam, tiang-tiangnya ialah solat dan puncaknya ialah jihad. \nKemudian, Baginda bersabda: Mahukah kamu aku khabarkan kunci segala perkara tersebut? Aku berkata: Ya, Rasulullah! Baginda memegang lidahnya lalu bersabda: Peliharalah benda ini! Aku berkata: Wahai, Nabi Allah! Adakah kita akan diseksa kerana perkara yang dibicarakan? Baginda bersabda: Sepatutnya kamu perlu tahu perkara ini, wahai, Muaz! Manusia itu dihumbankan dengan terjunam mukanya atau batang hidungnya ke dalam api neraka akibat percakapan lidah-lidah mereka.",
        "ar": "لَقَدْ سَأَلْتَ عَنْ عَظِيمٍ، وَﺇنَّهُ لَيَسِيرٌ عَلَى مَنْ یَسَّرَهُ اللهُ تَعَالَى عَلَيْهِ: تَعْبُدُ اللهَ لَا تُشْرِكْ بِهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ الْبَيْتَ، ثُمَّ قَالَ: أَلَا أَدُلُّكَ عَلَى أَبْوَابِ الْخَيْر؟ اَلصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا یُطْفِئُ الْمَاءُ النَّارَ، وَصَلَاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ، ثُمَّ \n\nتَلَا: ﴿                                   ... حَتَّى بَلَغَ ...                ططذ  ﴾  ثُمَّ قَالَ: أَلَاَ أُخْبِرُكَ بِرَأْسِ الْأَمْرِ وَعَمُودِهِ وَذِرْوَةِ سَنَامِهِ؟، قُلْتُ: بَلىَ یَا رَسُولَ اللهِ، قَالَ: رَأْسُ الْأَمْرِ الْإِسْلَامُ وَعَمُودُهُ الصَّلَاةُ وَذِرْوَةُ سَنَامِهِ الْجِهَادُ، ثُمَّ قَالَ: أَلَا أُخْبِرُكَ بِمِلَاكِ ذَلِكَ كُلِّهِ؟ قُلْتُ: بَلَى یَا رَسُولَ اللهِ، فَأَخَذَ بِلِسَانِهِ، وَقَالَ: كُفَّ عَلَيْكَ هَذَا، قُلْتُ: یَا نَبِيﱠ اللهِ، وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ؟، فَقاَلَ: ثَكِلَتْكَ أُمُّكَ يَا مُعَاذُ، وَهَلْ یَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ، أَوْ قَالَ عَلَى مَنَاخِرِهِمْ إِلَّا حَصَائِدُ أَلْسِنَتِهِمْ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Amalan puasa, sedekah dan qiamullail akan membuka pintu kebaikan. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap orang Islam yang taat dan berpegang teguh pada rukun Islam dan rukun iman dijamin syurga.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Puasa ialah perisai bagi melawan hawa nafsu.  Sedekah yang ikhlas mampu memadamkan dosa.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Orang Islam sejati mesti melaksanakan tuntutan agama dengan tekunnya dan istiqamah.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap orang Islam mestilah menjaga percakapannya daripada perkara sia-sia. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Muaz bin Jabal r.a., aku berkata kepada Rasulullah SAW: Wahai, Rasulullah! Terangkan aku amalan yang boleh memasukkan aku ke dalam syurga dan menjauhkan aku daripada api neraka. Baginda bersabda:  ",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 30,
    "hadith_title": {
      "ms": "Aturan Hukum  Allah SWT",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(حديث حسن. رواه الدارقطني وغيره)",
        "en": "",
        "ms": "(Hadis hasan. Riwayat al-Daraqutni dan lain-lain.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sesungguhnya Allah SWT memfardukan beberapa perkara fardu, janganlah kamu mengabaikannya. Dia telah menentukan beberapa batasan, janganlah kamu melampauinya. Dia telah mengharamkan beberapa perkara, janganlah kamu melanggarinya. Dia mendiamkan hukum tentang beberapa perkara sebagai keringanan kepadamu, maka janganlah kamu mempersoalkannya lagi. ",
        "ar": "إِنَّ اللهَ تَعَالَى فَرَضَ فَرَائِضَ، فَلَا تُضَيِّعُوهَا، وَحَدَّ حُدُودًا فَلَا تَعْتَدُوهَا، وَحَرَّمَ أَشْيَاءَ فَلَا تَنْتَهِكُوهَا، وَسَكَتَ عَنْ أَشْيَاءَ رَحمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلَا تَبْحَثُوا عَنْهَا."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Setiap orang Islam dituntut supaya mematuhi perintah Allah SWT sama ada berbentuk suruhan ataupun larangan. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Sebagai orang Islam, kita dituntut agar menjaga batasan antara perkara halal dengan haram. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Dalam beberapa perkara, Allah SWT tidak menyatakan hukum halal dan haram secara jelas.  Hal ini bukan bermaksud Allah SWT lupa, tetapi sebagai rahmat kepada manusia.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Tha‘labah al-Khusyani Jurthum bin Nasyir r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 31,
    "hadith_title": {
      "ms": "Hakikat Zuhud",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(حديث حسن. رواه ابن ماجه وغيره بأسانيد حسنة.)",
        "en": "",
        "ms": "(Hadis hasan. Riwayat Ibn Majah dan lain-lain dengan sanad hasan.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Zuhudlah terhadap dunia, nescaya Allah SWT mengasihimu dan zuhudlah terhadap sesuatu yang ada pada manusia, pasti manusia akan mengasihimu.",
        "ar": "اِزْهَدْ فِي الدُّنْيَا یُحِبَّكَ اللهُ، وَازْهَدْ فِيمَا عِنْدَ النَّاسِ یُحِبَّكَ النَّاسُ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Sifat zuhud penting dan wajib ada dalam diri setiap orang Islam.  ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Zuhud bermaksud tidak menjadikan dunia dan harta sebagai matlamat utama hidup. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Sifat zuhud tidaklah bermaksud meninggalkan kemewahan dunia atau langsung tidak berharta.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Sifat zuhud dapat mendidik hati manusia daripada perasaan iri hati terhadap harta dan kelebihan orang lain. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu al-Abbas Sahl bin Sa‘ad al-Sa‘idi r.a., beliau berkata: Seorang lelaki telah datang menemui Rasulullah SAW lalu berkata: Wahai, Rasulullah! Tunjukkan aku amalan yang apabila aku lakukannya, aku dikasihi oleh Allah SWT dan dikasihi oleh manusia. Baginda bersabda: ",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 32,
    "hadith_title": {
      "ms": "Jauhi Kemudaratan",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(حديث حسن. رواه ابن ماجه والدارقطني وغيرهما مسندا ورواه مالك في المؤطأ مرسلا عن عمروبن يحيى عن أبيه عن النبي ﷺ فأسقط أبا سعيد، وله طرق يقوي بعضها بعضا.)",
        "en": "",
        "ms": "(Hadis hasan. Riwayat Ibn Majah dan al-Daruqutni serta selainnya dengan sanad yang bersambung. Diriwayatkan juga oleh Imam Malik dalam al-Muwatta secara mursal daripada Amru bin Yahya daripada bapanya daripada Rasulullah SAW, tanpa menyebut Abu Saʻid. Namun begitu, riwayat ini memiliki sanad-sanad lain yang saling  menguatkannya.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Tidak boleh memudaratkan diri sendiri dan tidak boleh memudaratkan orang lain.",
        "ar": "لَا ضَرَرَ وَلَا ضِرَارَ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Sebarang kemudaratan sama ada terhadap diri sendiri atau terhadap orang lain hendaklah dijauhi.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Keharmonian hidup dapat dicapai dengan mengutamakan kemaslahatan dan menghindari kemudaratan. ",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Sa‘id Sa‘ad bin Malik bin Sinan al-Khudri r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 33,
    "hadith_title": {
      "ms": "Asas Pendakwaan",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(حديث حسن. رواه البيهقي وغيره هكذا، وبعضه في الصحيحين.)",
        "en": "",
        "ms": "(Hadis hasan. Riwayat al-Baihaqi dan lain-lain yang seumpamanya. Sebahagian lafaznya dalam Sahih al-Bukhari dan Sahih Muslim.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sekiranya setiap dakwaan diterima, pasti banyak orang akan menuntut harta dan darah sesuatu pihak (menuntut balas). Namun begitu, pihak yang mendakwa perlu mengemukakan bukti dan keterangan, manakala pihak yang tidak mengaku perlu bersumpah.",
        "ar": "لَوْ یُعْطَى النَّاسُ بِدَعْوَاهُمْ، لَادَّعَى رِجَالٌ أَمْوَالَ قَوْمٍ وَدِمَاءَهُمْ، لَكِنِ الْبَيِّنَةُ عَلَى الْمُدَّعِي، وَالْيَمِينُ عَلَى مَنْ أَنْكَرَ. "
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "lslam ialah agama yang adil dan saksama ketika menyelesaikan masalah umat. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap orang Islam mempunyai hak untuk membuat tuntutan dan dakwaan. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap tuntutan dan dakwaan perlu disertakan bukti dan keterangan. Pihak yang didakwa perlu bersumpah untuk menolak tuduhan terhadapnya.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada lbn Abbas r.a., Rasulullah SAW  bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 34,
    "hadith_title": {
      "ms": "Cegah Kemungkaran",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sesiapa yang melihat kemungkaran, hendaklah mengubah dengan tangannya. Sekiranya tidak mampu, hendaklah mengubah dengan lidahnya. Sekiranya tidak mampu juga, hendaklah mengubah dengan hatinya. Sesungguhnya (mengubah dengan hati) itu adalah selemah-lemah iman. ",
        "ar": "مَنْ رَأَى مِنْكُمْ مُنْكَراً فَلْيُغَيِّرْهُ بِيَدِهِ، فَإِنْ لَمْ یَسْتَطِعْ فَبِلِسَانِهِ، فَإِنْ لَمْ یَسْتَطِعْ فَبِقَلْبِهِ، وَذَلِكَ أَضْعَفُ الْإِیمَانِ. "
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Setiap orang Islam wajib menunaikan tanggungjawab untuk mencegah kemungkaran dengan kuasa atau teguran berdasarkan tahap kemampuan. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap orang Islam yang berautoriti dan berilmu wajib mencegah kemungkaran dengan kuasanya.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap orang Islam yang berilmu tetapi tiada autoriti wajib mencegah kemungkaran dengan teguran.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap orang Islam yang tiada autoriti dan tiada ilmu wajib membenci kemungkaran dengan hatinya.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Seseorang itu berdosa jika hanya membiarkan kemungkaran itu berlaku.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Saʻid al-Khudri r.a.: Aku mendengar Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 35,
    "hadith_title": {
      "ms": "Nilai Persaudaraan",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم)",
        "en": "",
        "ms": "(Riwayat Muslim)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Janganlah kamu saling mendengki, menipu, membenci, memalingkan muka antara satu sama lain (untuk memutuskan hubungan). Janganlah sebahagian kamu menjual barangan atas jualan orang lain. Hendaklah kamu menjadi hamba Allah yang bersaudara. Seorang Muslim ialah saudara bagi seorang Muslim; dia tidak boleh menzaliminya, membiarkannya tanpa bantuan, membohonginya dan menghinanya. Ketakwaan itu di sini (sambil Baginda menunjuk ke dadanya sebanyak tiga kali). Cukuplah keburukan seseorang itu apabila dia menghina saudara Muslimnya. Setiap Muslim terhadap Muslim yang lain itu haram darahnya, hartanya dan maruah dirinya. ",
        "ar": "لَا تَحَاسَدُوا، وَلَا تَنَاجَشُوا، وَلَا تَبَاغَضُوا، وَلَا تَدَابَرُوا، وَلَا یَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَكُونُوا عِبَادَ اللهِ إِخْوَانًا. الْمُسْلِمُ أَخُو الْمُسْلِمِ، لَا یَظْلِمُهُ وَلَا یَخْذُلُهُ، وَلَا یَكْذِبُهُ، وَلَا یَحْقِرُهُ، التَّقْوَى هَاهُناَ، وَیُشِيرُ إِلَى صَدْرِهِ ثَلَاثَ مَرَّاتٍ بِحَسْبِ امْرِىءٍ مِنَ الشَّرِّ أَنْ یَحْقِرَ أَخَاهُ الْمُسْلِمَ، كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ: دَمُهُ، وَمَالُهُ، وَعِرْضُهُ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "lslam melarang umatnya berhasad dengki, tipu-menipu, benci-membenci dan memutuskan hubungan persaudaraan kerana semua sifat ini ialah sifat buruk yang hanya akan membawa perpecahan dalam masyarakat. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "lslam melarang seseorang memintas urusan jual beli saudaranya sehingga dia selesai membuat keputusan sama ada mahu meneruskan jual beli tersebut ataupun membatalkannya. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Umat lslam digesa hidup sebagai hamba Allah SWT yang bersaudara dengan masing-masing menunaikan hak saudaranya dengan sempurna.  ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Takwa terserlah melalui amalan dan akhlak seseorang.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Hurairah r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 36,
    "hadith_title": {
      "ms": "Hak Sesama Islam dan Kepentingan Ilmu",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه مسلم بهذا اللفظ)",
        "en": "",
        "ms": "(Riwayat Muslim dengan lafaz hadis ini.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sesiapa yang melepaskan seorang Mukmin daripada satu kesusahan dunia, Allah SWT akan melepaskannya daripada satu kesusahan hari kiamat. Sesiapa yang mempermudah urusan orang susah, Allah SWT akan mempermudah urusannya di dunia dan di akhirat. Sesiapa yang menutup keaiban seorang Muslim, Allah SWT akan menutup keaibannya di dunia dan di akhirat. Allah SWT sentiasa menolong hamba-Nya selagi dia suka menolong saudaranya. Sesiapa yang melalui jalan untuk menuntut ilmu, Allah SWT akan mempermudah jalan menuju ke syurga. Apabila satu kumpulan berada di masjid sambil membaca dan mempelajari al-Quran, ketenangan akan turun, rahmat melitupi mereka dan para malaikat akan memayungi mereka. Allah SWT menyebut perihal mereka kepada para malaikat di sisi-Nya. Sesiapa yang kurang amalannya, kemuliaan keturunannya tidak dapat membantunya untuk melonjakkan darjatnya.",
        "ar": "مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ یَوْمِ الْقِيَامَةِ، وَمَنْ یَسَّرَ عَلَى مُعْسِرٍ یَسَّرَ اللهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةَ، وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللهُ فِي الدُّنْيَا وَالْآخِرَةِ، وَاللهُ فِي عَوْنِ العَبْدِ مَا كَانَ العَبْدُ فِي عَوْنِ أَخِيْهِ، وَمَنْ سَلَكَ طَرِیْقًا یَلْتَمِسُ فِيْهِ عِلْمًا سَهَّلَ اللهُ لَهُ بِهِ طَرِیْقًا إِلَى الْجَنَّةِ، وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللهِ یَتْلُونَ كِتَابَ اللهِ وَیَتَدَارَسُونَهُ بَيْنَهُمْ، إِلَّا نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ، وَغَشِيَتْهُمُ الرَّحْمَةُ، وَحَفَّتْهُمُ الْمَلَائِكَةُ، وَذَكَرَهُمُ اللهُ فِيمَنْ عِنْدَهُ، وَمَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ یُسْرِعْ بِهِ نَسَبُهُ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "lslam menggalakkan amalan tolong-menolong dan memperkuat ukhuwah antara satu sama lain. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "lslam menggalakkan umatnya supaya berusaha untuk melepaskan saudaranya yang dalam kesempitan dan kesusahan hidup.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Islam menyuruh umatnya menutup keaiban dirinya dan keaiban saudaranya.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Islam menggalakkan umatnya membaca dan mengkaji ilmu al-Quran khususnya di masjid.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Kemuliaan manusia terletak pada amalan soleh, bukan pada keturunan.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Hurairah r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 37,
    "hadith_title": {
      "ms": "Keadilan dan  Kurniaan Allah SWT",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري ومسلم في صحيحيهما بهذه الحروف.)",
        "en": "",
        "ms": "(Riwayat al-Bukhari dan Muslim dalam kedua-dua kitab sahih mereka dengan lafaz sebegini.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Allah SWT menulis segala kebaikan dan kejahatan, kemudian Dia menjelaskannya; sesiapa yang berniat untuk mengerjakan satu kebaikan tetapi dia tidak melakukannya, Allah SWT akan menulis satu kebaikan penuh di sisi-Nya. Sekiranya dia berniat untuk mengerjakan satu kebaikan lalu dia melakukannya, Allah SWT akan menulis 10 kebaikan hingga 700 kali ganda bahkan berlipat kali ganda di sisi-Nya. Sekiranya dia berniat untuk mengerjakan satu kejahatan tetapi dia tidak melakukannya, Allah SWT akan menulis satu kebaikan penuh di sisi-Nya. Sekiranya dia berniat untuk mengerjakan satu kejahatan dan dia melakukannya, Allah SWT akan menulis satu kejahatan sahaja di sisi-Nya.",
        "ar": "إِنَّ اللهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ، فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ یَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِمِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ، وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ یَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ سَيِّئَةً وَاحِدَةً."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Allah SWT membalas satu perbuatan baik dengan 10 kebaikan. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Allah SWT membalas satu perbuatan jahat dengan satu kejahatan. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Kasih sayang dan rahmat Allah SWT tiada batasan. Sebanyak 10 pahala yang dikurniakan-Nya dapat mencapai ganjaran hingga 700 kali ganda atau lebih lagi.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada lbn Abbas r.a., daripada Rasulullah SAW, Allah SWT berfirman:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 38,
    "hadith_title": {
      "ms": "Kelebihan Bertaqarub kepada Allah SWT",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري)",
        "en": "",
        "ms": "(Riwayat al-Bukhari)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sesiapa yang memusuhi wali-Ku, Aku akan mengisytiharkan perang terhadapnya. Seorang hamba-Ku tidak bertaqarub (menghampirkan dirinya) kepada-Ku dengan suatu amalan yang lebih Aku sukai daripada amalan yang Aku fardukan atasnya. Seseorang hamba sentiasa bertaqarub dirinya kepada-Ku, dengan amalan-amalan sunat sehingga Aku mengasihinya. Apabila Aku sudah mengasihinya, jadilah Aku pendengarannya yang dia mendengar sesuatu dengannya, jadilah Aku pelihatannya yang dia melihat sesuatu dengannya, jadilah Aku tangannya yang dengannya dia melakukan kerja, jadilah Aku kakinya yang dengannya dia berjalan. Sekiranya dia meminta daripada-Ku, Aku akan mengurniainya dan sekiranya dia meminta perlindungan daripada-Ku, nescaya Aku akan melindunginya. ",
        "ar": "مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ، وَمَا یَزَالُ عَبْدِي یَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي یَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي یُبْصِرُ بِهِ، وَیَدَهُ الَّتِي یَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي یَمْشِي بِهَا، وَلَئِنْ سَأَلَنِي لَأُعْطِيَنَّهُ وَلَئِنِ اسْتَعَاذَنِي لَأُعِيْذَنَّهُ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Wali Allah SWT ialah orang yang beriman dan bertakwa yang tingkah lakunya sentiasa dibimbing oleh Allah SWT. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Amalan yang paling disukai Allah SWT ialah amalan fardu yang diwajibkan atas hamba-Nya.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Perbuatan mengerjakan amalan sunat dengan mengabaikan amalan fardu menyalahi tuntutan syarak.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Hurairah r.a., Rasulullah SAW bersabda, Allah SWT berfirman:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 39,
    "hadith_title": {
      "ms": "Kesalahan Umat yang Dimaafkan",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(حديث حسن. رواه ابن ماجه والبيهقي وغيرهما.)",
        "en": "",
        "ms": "(Hadis hasan. Riwayat Ibn Majah, al-Baihaqi dan selain kedua-duanya.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Sesungguhnya Allah SWT mengampunkan perbuatan umatku (demiku) yang dilakukan secara tersilap, terlupa dan terpaksa.",
        "ar": "إِنَّ اللهَ تجَاَوَزَ لِي عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ. "
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Allah SWT hanya menghitung dosa yang dilakukan secara sedar, sengaja dan tanpa paksaan.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Kesalahan yang dilakukan secara tidak sengaja, lupa dan kerana paksaan tidak berdosa.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Kemaafan terhadap kesalahan yang dilakukan secara tidak sengaja, lupa dan paksaan merupakan kemuliaan yang dikurniakan oleh Allah SWT kepada Rasulullah SAW.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Perundangan dan kehakiman lslam amat mengutamakan keadilan.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada lbn Abbas r.a., Rasulullah SAW bersabda: ",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 40,
    "hadith_title": {
      "ms": "Usah Bertangguh",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه البخاري)",
        "en": "",
        "ms": "(Riwayat al-Bukhari)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Hiduplah kamu di dunia seolah-olah kamu orang asing atau musafir. lbn Umar r.a. pernah berkata: Apabila kamu berada pada waktu petang, janganlah menunggu waktu pagi. Apabila kamu berada pada waktu pagi, janganlah menunggu waktu petang. Gunakanlah masa sihatmu sebelum masa sakitmu dan masa hidupmu sebelum matimu. ",
        "ar": "كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِیبٌ، أَوْ عَابِرُ سَبِيلٍ.وَكَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا یَقُولُ: إِذَا أَمْسَيْتَ فَلَا تَنْتَظِرِ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلَا تَنْتَظِرِ الْمَسَاءَ، وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ، وَمِنْ حَيَاتِكَ لِمَوْتِكَ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Kehidupan di dunia hanyalah sementara, sebaliknya akhirat yang kekal abadi. ",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap orang Islam hendaklah menghargai nikmat masa, sihat dan hidup.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Setiap orang Islam dilarang bertangguh dalam perkara kebaikan.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada lbn Umar r.a.: Rasulullah SAW memegang bahuku sambil bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 41,
    "hadith_title": {
      "ms": "Menundukkan Hawa Nafsu",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(حديث حسن صحيح. رويناه في كتاب الحجة بإسناد صحيح.) ",
        "en": "",
        "ms": "(Hadis hasan sahih. Diriwayatkan kepada kami secara bersambung sanad dengan kitab al-Hujjah. Sanad ini sahih.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Tidak sempurna iman seseorang sehinggalah hawa nafsunya menuruti ajaran yang kubawa. ",
        "ar": "لَا یُؤْمِنُ أَحَدُكُمْ حَتَّى یَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Tidak sempurna iman seseorang sekiranya dia mengutamakan hawa nafsu.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Orang yang beriman sentiasa melawan hawa nafsu.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Abu Muhammad Abdullah bin Amru bin   al-As r.a., Rasulullah SAW bersabda:",
        "ar": ""
      }
    ]
  },
  {
    "footnotes": [],
    "number": 42,
    "hadith_title": {
      "ms": "Allah SWT Maha Pengampun",
      "en": "",
      "ar": ""
    },
    "narratedBy": [
      {
        "ar": "(رواه الترمذي وقال حديث حسن صحيح.)",
        "en": "",
        "ms": "(Riwayat al-Tirmizi. Menurut al-Tirmizi, hadis ini hasan sahih.)"
      }
    ],
    "content": [
      {
        "en": "",
        "ms": "Wahai, anak Adam! Selagi kamu meminta, berdoa dan mengharapkan-Ku, Aku akan mengampunkan segala dosa yang ada pada dirimu dan Aku tidak peduli. Wahai, anak Adam! Seandainya dosa-dosamu banyak hingga mencecah langit, kemudian kamu memohon keampunan daripada-Ku, Aku akan memberikan keampunan kepadamu. Wahai, anak Adam! Seandainya kamu datang menghadap-Ku dengan dosa sepenuh isi bumi, kemudian kamu datang menghadap-Ku (di akhirat) tanpa mensyirikkan Aku dengan sesuatu, Aku akan mengurniaimu keampunan sepenuh isi bumi. ",
        "ar": "یَا ابْنَ آدَمَ! إِنَّكَ مَا دَعَوْتَنِي وَرَجَوْتَنِي غَفَرْتُ لَكَ، عَلَى مَا كَانَ مِنْكَ وَلَا أُبَالِي. یَا ابْنَ آدَمَ! لَوْ بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ، ثُمَّ اسْتَغْفَرْتَنِي غَفَرْتُ لَكَ وَلَا أُبَالِي. یَا ابْنَ آدَمَ! إِنَّكَ لَوْ أَتَيْتَنِي بِقُرَابِ الْأَرْضِ خَطَایَا ثُمَّ لَقِيتَنِي لَا تُشْرِكُ بِي شَيْئًا لَأَتَيْتُكَ بِقُرَابِهَا مَغْفِرَةً."
      }
    ],
    "lesson": [
      {
        "en": "",
        "ms": "Rahmat dan belas kasihan Allah SWT amat besar dan luas. Namun begitu, tidak bermakna seseorang itu boleh melakukan dosa dengan sewenang-wenangnya.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Allah SWT berjanji akan mengampunkan segala dosa hambanya dengan syarat mereka berdoa, mengharapkan keampunan-Nya serta tidak mensyirikkan Allah SWT.",
        "ar": ""
      },
      {
        "en": "",
        "ms": "Syirik ialah dosa besar yang tidak akan diampunkan oleh Allah SWT jika tidak bertaubat.",
        "ar": ""
      }
    ],
    "narrators": [
      {
        "en": "",
        "ms": "Daripada Anas r.a.: Aku mendengar Rasulullah SAW bersabda, Allah SWT berfirman:",
        "ar": ""
      }
    ]
  }
]